pl-sql/3-3.tex
% Created 2023-10-28 sáb 22:10
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[margin=0.5in]{geometry}
\author{Agustín Alejandro Mota Hinojosa}
\date{\today}
\title{3-3:  Manipulating Data in PL/SQL}
\hypersetup{
 pdfauthor={Agustín Alejandro Mota Hinojosa},
 pdftitle={3-3:  Manipulating Data in PL/SQL},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Vocabulary}
\label{sec:org822b710}
\begin{enumerate}
\item Defined automatically by Oracle for all SQL data manipulation statements, and for queries that return only one row.

\textbf{Cursor implicit}

\item Defined by the programmer for queries that return more than one row.

\textbf{Cursor explicit}

\item Statement selects rows from one table to update and/or insert into another table. The decision whether to update or insert into the target table is based on a condition in the ON clause.

\textbf{Merge}

\item Statement adds new rows to the table.

\textbf{Insert}

\item Statement removes rows from the table.

\textbf{Delete}

\item Statement modifies existing rows in the table.

\textbf{Update}
\end{enumerate}
\section{Try It / Solve It}
\label{sec:org1b141e5}
\begin{enumerate}
\item True or False: When you use DML in a PL/SQL block, Oracle uses explicit cursors to track the data changes.
\textbf{True}
\item SQL\%FOUND, SQL\%NOTFOUND, and SQL\%ROWCOUNT are \textbf{Cursor Attributes} and are available when you use \textbf{implicit} cursors.
\item Examine and run the following PL/SQL code, which obtains and displays the maximum department\textsubscript{id} from new\textsubscript{depts}. What is the maximum department id?

\begin{minted}[]{sql}
    DECLARE
        v_max_deptno new_depts.department_id%TYPE;
    BEGIN
        SELECT MAX(department_id) INTO v_max_deptno
        FROM new_depts;
        DBMS_OUTPUT.PUT_LINE('The maximum department id is: ' || v_max_deptno);
    END;
\end{minted}

\item Modify the code to declare two additional variables (assigning a new department name to one of them), by adding the following two lines to your Declaration section:

\begin{minted}[]{sql}
    v_dept_name    new_depts.department_name%TYPE := 'A New Department';
    v_dept_id
    new_depts.department_id%TYPE;
\end{minted}

\begin{minted}[]{sql}
    DECLARE
        v_max_deptno new_depts.department_id%TYPE;
        v_dept_name new_depts.department_name%TYPE := 'A New Department';
        v_dept_id new_depts.department_id%TYPE;
    BEGIN
        SELECT MAX(department_id) INTO v_max_deptno
        FROM new_depts;
        DBMS_OUTPUT.PUT_LINE('The maximum department id is: ' || v_max_deptno);
    END;
\end{minted}

\item Modify the code to add 10 to the current maximum department number and assign the result to v\textsubscript{dept}\textsubscript{id}.

\begin{minted}[]{sql}
    DECLARE
        v_max_deptno new_depts.department_id%TYPE;
        v_dept_name new_depts.department_name%TYPE := 'A New Department';
        v_dept_id new_depts.department_id%TYPE;
    BEGIN
        SELECT MAX(department_id) INTO v_max_deptno FROM new_depts;
        DBMS_OUTPUT.PUT_LINE('The maximum department id is: ' || v_max_deptno);
        v_dept_id := v_max_deptno + 10;
        DBMS_OUTPUT.PUT_LINE('v_dept_id: '|| v_dept_id);
    END;
\end{minted}

\item Modify the code to include an INSERT statement to insert a new row into the new\textsubscript{depts} table, using v\textsubscript{dept}\textsubscript{id} and v\textsubscript{dept}\textsubscript{name} to populate the department\textsubscript{id} and department\textsubscript{name} columns. Insert NULL into the location\textsubscript{id} and manager\textsubscript{id} columns.  Execute your code and confirm that the new row has been inserted.

\begin{minted}[]{sql}
    DECLARE
        v_max_deptno new_depts.department_id%TYPE;
        v_dept_name new_depts.department_name%TYPE := 'A New Department';
        v_dept_id new_depts.department_id%TYPE;
    BEGIN
        SELECT MAX(department_id) INTO v_max_deptno FROM new_depts;
        DBMS_OUTPUT.PUT_LINE('The maximum department id is: ' || v_max_deptno);
        v_dept_id := v_max_deptno + 10;
        INSERT INTO new_depts(department_id, department_name, manager_id, location_id)
        VALUES(v_dept_id, v_dept_name, NULL, NULL);
        DBMS_OUTPUT.PUT_LINE('v_dept_id: '|| v_dept_id);
    END;
\end{minted}

\item Now modify the code to use SQL\%ROWCOUNT to display the number of rows inserted, and execute the block again.

\begin{minted}[]{sql}
    DECLARE
        v_max_deptno new_depts.department_id%TYPE;
        v_dept_name new_depts.department_name%TYPE := 'A New Department';
        v_dept_id new_depts.department_id%TYPE;
    BEGIN
        SELECT MAX(department_id) INTO v_max_deptno
        FROM new_depts;
        DBMS_OUTPUT.PUT_LINE('The maximum department id is: ' || v_max_deptno);
        v_dept_id := v_max_deptno + 10;
        INSERT INTO new_depts(department_id, department_name, manager_id, location_id)
        VALUES(v_dept_id, v_dept_name, NULL, NULL);
        DBMS_OUTPUT.PUT_LINE(SQL%ROWCOUNT);
    END;
\end{minted}

\item Now modify the block, removing the INSERT statement and adding a statement that will UPDATE all rows with location\textsubscript{id} = 1700 to location\textsubscript{id} = 1400. Execute the block again to see how many rows were updated.
\begin{minted}[]{sql}
    DECLARE
        v_max_deptno new_depts.department_id%TYPE;
        v_dept_name new_depts.department_name%TYPE := 'A New Department';
        v_dept_id new_depts.department_id%TYPE;
    BEGIN
        SELECT MAX(department_id) INTO v_max_deptno
        FROM new_depts;
        DBMS_OUTPUT.PUT_LINE('The maximum department id is: ' || v_max_deptno);
        v_dept_id := v_max_deptno + 10;
        UPDATE new_depts SET location_id = 1400 WHERE location_id = 1700;
        DBMS_OUTPUT.PUT_LINE(SQL%ROWCOUNT);
    END;
\end{minted}
\end{enumerate}
\end{document}